* Set up gitinfo2

This sets up gitinfo2 so that the git version number and branch are included in any PDFs generated from this document.

#+BEGIN_SRC sh :cmdline -i :results verbatim
git init
SRC=~/Documents/templates/gitinfo2.script
for f in `echo 'commit' 'merge' 'checkout'`; do
    DEST=./.git/hooks/post-${f}
    cp $SRC $DEST
    chmod u+x $DEST
    echo $SRC $DEST
done
#+END_SRC
#+RESULTS:
: /Users/mankoff/Documents/templates/gitinfo2.script ./.git/hooks/post-commit
: /Users/mankoff/Documents/templates/gitinfo2.script ./.git/hooks/post-merge
: /Users/mankoff/Documents/templates/gitinfo2.script ./.git/hooks/post-checkout
